Feature: SearchProperty feature
  Scenario: Купуване на имот с валидни данни
    Given потребителя отваря станицата на имота
    And натиска върху бутона за купуване на имот
    And визуализира се форма за купуване на имот
    When избере някои от предоставените начини за плащане
    And въведе валиден имеѝл
    And натисне бутона за закуване
    Then вижда съобщение с текст "Успешно закупен"

  Scenario: Купуване на имот без начин на плащане
    Given потребителя отваря станицата на имота
    And натиска върху бутона за купуване на имот
    And визуализира се форма за купуване на имот
    When избере някои от предоставените начини за плащане
    And натисне бутона за закуване
    Then вижда съобщение с текст "Попълнете всички полета"

  Scenario: Купуване на имот без начин на плащане и имеѝл
    Given потребителя отваря станицата на имота
    And натиска върху бутона за купуване на имот
    And визуализира се форма за купуване на имот
    When въведе валиден имеѝл
    And натисне бутона за закуване
    Then вижда съобщение с текст "Попълнете всички полета"

  Scenario: Купуване на имот без да попълва нищо
    Given потребителя отваря станицата на имота
    And натиска върху бутона за купуване на имот
    And визуализира се форма за купуване на имот
    When натисне бутона за закуване
    Then вижда съобщение с текст "Попълнете всички полета"

  Scenario: Купуване на имот с невалиден имеѝл
    Given потребителя отваря станицата на имота
    And натиска върху бутона за купуване на имот
    And визуализира се форма за купуване на имот
    When въведе невалиден имеѝл
    And избере някои от предоставените начини за плащане
    And натисне бутона за закуване
    Then вижда съобщение с текст "Невалидни данни"


