Feature: Search feature

  Scenario: Търсене в системата с валидни входни данни
    Given потребителя отваря началната страница
    And натиска върху бутона за търсене в системата
    And визуализира се форма за търсене в системата
    When въведе валидни входни данни за търсене
    And натисне бутона за търсене
    Then вижда съобщение "Намерено"

  Scenario: Търсене в системата с невалидни входни данни
    Given потребителя отваря началната страница
    And натиска върху бутона за търсене в системата
    And визуализира се форма за търсене в системата
    When въведе невалидни входни данни за търсене
    And натисне бутона за търсене
    Then вижда съобщение "Невалидни входни данни"

  Scenario: Търсене в системата без входни данни
    Given потребителя отваря началната страница
    And натиска върху бутона за търсене в системата
    And визуализира се форма за търсене в системата
    When натисне бутона за търсене
    Then вижда съобщение "Липса на входни данни"

  Scenario: Търсене в системата на имот, което съвпада с част от името
    Given потребителя отваря началната страница
    And натиска върху бутона за търсене в системата
    And визуализира се форма за търсене в системата
    When въведе част от валидното име на имота
    And натисне бутона за търсене
    Then вижда съобщение "Намерено"

  Scenario: Търсене в системата на имот, който не съществува
    Given потребителя отваря началната страница
    And натиска върху бутона за търсене в системата
    And визуализира се форма за търсене в системата
    When въведе валидно име на имота, който не съществува
    And натисне бутона за търсене
    Then вижда съобщение "Няма намерени резултати"

  Scenario: Търсене в системата с входни данни, надвишаващи максималната дължина
    Given потребителя отваря началната страница
    And натиска върху бутона за търсене в системата
    And визуализира се форма за търсене в системата
    When въведе име на имота, което е над 30 символа
    And натисне бутона за търсене
    Then вижда съобщение "Невалидни входни данни"

